/*
    昨天弄了一场热身签到赛，结果忘了签到了。
    小小留念一下弱的弱智：直接输入样例所示。结果全场迷之RE。
    后来请教ZhenJu，弱添加题目的时候只添加了输出文件，HDOJ上的DIY自己添加题目时，需要添加输入输出两个文件都成功才行。
*/
#include<stdio.h>
int main()
{
    puts("*****************************");
    puts("*******Y************YYYYY****");
    puts("******Y*Y*********YY*********");
    puts("*****Y***Y*******Y***********");
    puts("****YYYYYYY******Y***********");
    puts("***Y*******Y******YY*********");
    puts("**Y*********Y*******YYYYY****");
    puts("*****************************");
    return 0;
}


